[
  {
    "id": 1,
    "title": "Réaliser un développement d'application ",
    "sousCompetence": [
      {
        "title": "Choisir et implémenter les architectures adaptées",
        "description": "Participation à la conception d'une solution RAG (Retrieval-Augmented Generation) avec le modèle Mistral, en choisissant une architecture adaptée à l'intégration de LLMs et d'un moteur de recherche vectoriel. J'ai contribué à la définition des composants clés comme les modèles utilisée et l'intégration de la solution sur un contrôlleur au sein des bureaux."
      },
      {
        "title": "Faire évoluer une application existante",
        "description": "Maintenance évolutive de plusieurs applications pour le CEREMA dans le cadre de la TMA. Mes tâches ont consisté à ajouter de nouvelles fonctionnalités comme [...], corriger des bugs liés à [...] et améliorer la performance ou l'ergonomie sur des modules tels que [...]."
      },
      {
        "title": "Intégrer des solutions dans un environnement de production",
        "description": "Déploiement d’un modèle YOLO pour le comptage de poids lourds dans un environnement industriel. Cette intégration a nécessité l’adaptation du modèle à [...], ainsi que la mise en place de scripts d'automatisation pour [...]."
      }
    ]
  },
  {
    "id": 2,
    "title": "Optimiser des applications",
    "sousCompetence": [
      {
        "title": "Anticiper les résultats de diverses métriques (temps d'exécution, occupation mémoire...)",
        "description": "Optimisation d’un pipeline basé sur YOLO, en veillant à maintenir un bon compromis entre précision et vitesse. J’ai mis en place des tests de performance sur les métriques telles que [...], puis proposé des ajustements comme [...]."
      },
      {
        "title": "Profiler, analyser et justifier le comportement d'un code existant",
        "description": "J’ai utilisé des outils de profiling comme [...] pour analyser les performances d’applications en production. Cela m’a permis d’identifier des goulots d’étranglement dans [...], et de justifier les améliorations proposées auprès de [...]."
      },
      {
        "title": "Choisir et utiliser des bibliothèques et méthodes dédiées au domaine d'application (imagerie, immersion, intelligence artificielle, jeux vidéos,",
        "description": "Sélection et mise en œuvre de bibliothèques spécialisées comme YOLOv5 pour la vision par ordinateur et [LangChain/Faiss/autre] pour le RAG. Le choix des outils s’est basé sur les critères de [...], en fonction des contraintes du projet [...]."
      }
    ]
  },
  {
    "id": 3,
    "title": "Collaborer au sein d'une équipe informatique",
    "sousCompetence": [
      {
        "title": "Organiser et partager une veille numérique",
        "description": "Réalisation d’une veille technologique sur les sujets d’intelligence artificielle et de vision par ordinateur. J’ai notamment rédigé des synthèses sur [...], et animé des sessions de partage avec l’équipe sur [...]."
      },
      {
        "title": "Guider la conduite du changement informatique au sein d'une organisation",
        "description": "Accompagnement des utilisateurs et des équipes techniques lors des changements apportés aux applications du CEREMA. Cela a inclus la rédaction de guides d’utilisation pour [...], et la participation aux phases de recette pour [...]."
      },
      {
        "title": "Accompagner le management de projet informatique",
        "description": "Collaboration avec les chefs de projet dans le cadre d’une méthodologie Agile. J’ai suivi les tickets via [Jira/Trello/Redmine], estimé les charges pour [...], et participé aux réunions de suivi pour ajuster les priorités sur [...]."
      }
    ]
  }
]
