[
  {
    "id": 1,
    "title": "Réaliser un développement d'application ",
    "sousCompetence": [
      {
        "title": "Choisir et implémenter les architectures adaptées",
        "description": "Participation à la conception d'une solution RAG (Retrieval-Augmented Generation) avec le modèle Mistral, en choisissant une architecture adaptée à l'intégration de LLMs et d'un moteur de recherche vectoriel."
      },
      {
        "title": "Faire évoluer une application existante",
        "description": "Maintenance évolutive de plusieurs applications pour le CEREMA dans le cadre de la TMA, incluant des correctifs, des optimisations et l'ajout de nouvelles fonctionnalités sur une dizaine de projets."
      },
      {
        "title": "Intégrer des solutions dans un environnement de production",
        "description": "Déploiement et intégration d'un modèle YOLO pour le comptage de poids lourds dans un environnement de production, avec adaptation aux contraintes techniques du terrain."
      }
    ]
  },
  {
    "id": 2,
    "title": "Optimiser des applications",
    "sousCompetence": [
      {
        "title": "Anticiper les résultats de diverses métriques (temps d'exécution, occupation mémoire...)",
        "description": "Optimisation des performances d'un pipeline de traitement d’images utilisant YOLO, en prenant en compte le temps de traitement et la charge mémoire pour assurer un fonctionnement temps réel."
      },
      {
        "title": "Profiler, analyser et justifier le comportement d'un code existant",
        "description": "Analyse régulière de codes existants dans les applications CEREMA afin de détecter des lenteurs ou des anomalies, avec production de rapports expliquant les causes et les solutions envisagées."
      },
      {
        "title": "Choisir et utiliser des bibliothèques et méthodes dédiées au domaine d'application (imagerie, immersion, intelligence artificielle, jeux vidéos,",
        "description": "Utilisation de bibliothèques d’intelligence artificielle comme YOLO pour le traitement d’images et de frameworks LLM pour la mise en œuvre d’un RAG, avec une adaptation aux cas d’usage spécifiques."
      }
    ]
  },
  {
    "id": 3,
    "title": "Collaborer au sein d'une équipe informatique",
    "sousCompetence": [
      {
        "title": "Organiser et partager une veille numérique",
        "description": "Réalisation d’une veille régulière sur les technologies d’IA générative et de vision par ordinateur, partagée avec l’équipe sous forme de présentations internes ou de documents techniques."
      },
      {
        "title": "Guider la conduite du changement informatique au sein d'une organisation",
        "description": "Accompagnement des équipes du CEREMA lors de la mise en œuvre de nouvelles fonctionnalités ou d'évolutions d'applications, avec documentation et assistance utilisateur."
      },
      {
        "title": "Accompagner le management de projet informatique",
        "description": "Suivi des tâches dans un contexte Agile sur les projets de TMA, remontée d’avancement, échanges réguliers avec les chefs de projets et participation à la planification des évolutions."
      }
    ]
  }
]
